`timescale 1ns / 1ps
`default_nettype none

// ============================================================================
// Accelerator Algorithm Logic
//
// !!! 比赛现场主要修改这个文件 !!!
//
// array_accel_engine 负责：
//     - 地址
//     - ExtRAM
//     - 数组遍历
//     - handshake
//     - 写回
//
// 本模块只负责：
//
//             result = reduce(A[i])
//
// ============================================================================

module accelerator_logic (
    input  wire        clk,
    input  wire        resetn,

    // 一次新任务开始
    input  wire        run_start,

    // A[0] 返回
    input  wire        first_valid,

    // A[1] ~ A[n-1] 返回
    input  wire        data_valid,

    // 当前 SRAM 数据
    input  wire [31:0] data,

    // 最终 32-bit 结果
    output wire [31:0] result
);


    // ========================================================================
    // >>>>>>>>>>>>>>>>>>> USER MODIFY REGION 1 BEGIN <<<<<<<<<<<<<<<<<<<<<<<<<
    //
    // 算法需要的寄存器
    //
    // 允许：
    //     新增寄存器
    //     删除不用的寄存器
    //
    // 不允许把 SRAM / 地址遍历逻辑放进这里。
    // ========================================================================


    // 通用最终结果
    reg [31:0] result_reg;


    // 如果题目需要记住第一个元素，可以使用它。
    //
    // 2024 MAX 不需要；
    // 2025 count-first 需要。
    reg [31:0] key_reg;


    // 可选临时寄存器
    // reg [31:0] aux_reg;


    // ========================================================================
    // >>>>>>>>>>>>>>>>>>> USER MODIFY REGION 1 END <<<<<<<<<<<<<<<<<<<<<<<<<<<
    // ========================================================================




    always @(posedge clk) begin

        if (!resetn) begin

            result_reg <= 32'b0;
            key_reg <= 32'b0;

        end

        // ====================================================================
        // >>>>>>>>>>>>>>> USER MODIFY REGION 2 BEGIN <<<<<<<<<<<<<<<<<<<<<<<<<<
        //
        // 每次新任务开始时初始化算法状态
        //
        // 注意：
        // 此时还没有收到 A[0]
        //
        // ====================================================================

        else if (run_start) begin

            result_reg <= 32'b0;
            key_reg <= 32'b0;

        end

        // ====================================================================
        // >>>>>>>>>>>>>>> USER MODIFY REGION 2 END <<<<<<<<<<<<<<<<<<<<<<<<<<<<
        // ====================================================================



        // ====================================================================
        // >>>>>>>>>>>>>>> USER MODIFY REGION 3 BEGIN <<<<<<<<<<<<<<<<<<<<<<<<<<
        //
        // 第一个数组元素 A[0]
        //
        // data == A[0]
        //
        // 2024 最大值：
        //
        //      result = A[0]
        //
        // ====================================================================

        else if (first_valid) begin

            result_reg <= 32'b1;
            key_reg    <= data;
        end

        // ====================================================================
        // >>>>>>>>>>>>>>> USER MODIFY REGION 3 END <<<<<<<<<<<<<<<<<<<<<<<<<<<<
        // ====================================================================



        // ====================================================================
        // >>>>>>>>>>>>>>> USER MODIFY REGION 4 BEGIN <<<<<<<<<<<<<<<<<<<<<<<<<<
        //
        // 后续每一个数组元素：
        //
        // A[1]
        // A[2]
        // A[3]
        // ...
        //
        // 比赛现场最主要修改这里。
        //
        //
        // 当前示例：2024 数组无符号最大值
        //
        //      if (A[i] > result)
        //          result = A[i];
        //
        // ====================================================================

        else if (data_valid) begin

            if (data == key_reg)
                result_reg <= result_reg + 32'b1;

        end

        // ====================================================================
        // >>>>>>>>>>>>>>> USER MODIFY REGION 4 END <<<<<<<<<<<<<<<<<<<<<<<<<<<<
        // ====================================================================

    end



    // ========================================================================
    // FIXED RESULT INTERFACE
    //
    // 最好永远不要修改。
    //
    // engine 最终自动：
    //
    //       MEM[RESULT_ADDR] = result
    //
    // ========================================================================

    assign result = result_reg;


endmodule

`default_nettype wire
